# ElementMulticategoryFilter Constructor (ICollection(ElementId))

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementMulticategoryFilter Constructor (ICollection<(Of <(<'ElementId>)>)>)
ElementMulticategoryFilter Class See Also
---
Constructs a new instance of a filter to find elements whose category matches any of a given set of categories.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementMulticategoryFilter(
	ICollection<ElementId> categoryIds
)
```

Visual Basic
---
```text
Public Sub New ( _
	categoryIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
ElementMulticategoryFilter(
	ICollection<ElementId^>^ categoryIds
)
```

# ### Parameters
categoryIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The category ids to match.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more categories was not valid for filtering. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementMulticategoryFilter Class
ElementMulticategoryFilter Overload
Autodesk.Revit.DB Namespace